{
  "start": {
    "text": "Il lupo Bruno, con un brontolio nello stomaco, vede l'agnello Nino che saltella felice nel Prato Fiorito. E tempo di un inseguimento divertente!",
    "actions": {
      "Avvicinarsi in punta di zampe, cercando di sorprenderlo": "initiate_stealth_chase",
      "Lanciare un simpatico 'Bau!' e invitarlo al gioco": "initiate_playful_chase"
    }
  },
  "initiate_stealth_chase": {
    "text": "Nino, con l'istinto animale, percepisce Bruno e con un balzo parte verso la Collina Solare. La caccia e ufficialmente un gioco!",
    "actions": {
      "Continuare l'inseguimento sulla Collina, tra i fiori selvatici": "chase_on_hill_ready",
      "Cambiare tattica e cercare di tagliare la strada verso il Ruscello": "chase_to_stream_ready"
    }
  },
  "initiate_playful_chase": {
    "text": "Nino si volta e, riconoscendo il tono giocoso di Bruno, lo sfida a una corsa fino al Ruscello Scintillante. La partita e aperta!",
    "actions": {
      "Saltare le rocce e rincorrere Nino lungo il Ruscello": "chase_by_stream_ready",
      "Rimanere nel Prato e sfidarlo a una gara di giravolte": "chase_in_prato_ready"
    }
  },
  "chase_on_hill_ready": {
    "text": "Sulla Collina, Bruno e Nino si rincorrono tra risate e salti. L'agnello, stanco ma felice, si ferma per un attimo, pronto per il 'prendimi'.",
    "actions": {
      "Bruno lo circonda con un finto morso al collo": "playful_capture_final",
      "Nino si arrende con un buffo crollo a terra": "playful_capture_final"
    }
  },
  "chase_to_stream_ready": {
    "text": "La corsa al Ruscello e stata spassosa, tra schizzi e scivoloni. Nino si affaccia all'acqua, esausto ma sorridente, aspettando l'ultimo atto del gioco.",
    "actions": {
      "Bruno lo spinge delicatamente in un mucchio di foglie": "playful_capture_final",
      "Nino si nasconde dietro un albero e aspetta di essere trovato": "playful_capture_final"
    }
  },
  "chase_by_stream_ready": {
    "text": "Lungo il Ruscello, la caccia e un balletto acquatico. Nino, bagnato e divertito, si siede su una pietra, pronto a farsi 'catturare'.",
    "actions": {
      "Bruno lo avvolge in un abbraccio giocoso": "playful_capture_final",
      "Nino gli offre la zampa come segno di resa divertita": "playful_capture_final"
    }
  },
  "chase_in_prato_ready": {
    "text": "Nel Prato Fiorito, le giravolte li hanno resi entrambi un po' storditi. Nino barcolla verso Bruno, pronto per la fine del gioco del 'predatore e preda'.",
    "actions": {
      "Bruno lo stuzzica con una leccata giocosa sul naso": "playful_capture_final",
      "Nino si sdraia sull'erba invitando Bruno a 'vincere'": "playful_capture_final"
    }
  },
  "playful_capture_final": {
    "text": "Con un ultimo gesto affettuoso e divertito, Bruno 'cattura' l'agnello Nino. La 'caccia' e finita. Nessuno e stato davvero mangiato, solo tanto, tanto divertimento!",
    "actions": {}
  }
}