{
  "start": {
    "text": "Il villaggio di Elia geme sotto il sole implacabile. La terra è secca, i pozzi vuoti e la speranza svanisce come fumo. Tutti parlano della Fonte Magica, ora solo una leggenda sbiadita, ma nessuno osa cercarla. Elia, con un cuore pieno di coraggio, decide che è lei a dover agire.",
    "actions": {
      "Abbandona il villaggio e avventurati nel misterioso bosco": "journey_forest"
    }
  },
  "journey_forest": {
    "text": "Con un profondo respiro, Elia si addentra nel fitto bosco. Gli alberi secolari sussurrano segreti antichi, e il silenzio è rotto solo dal fruscio delle foglie sotto i suoi passi. Ogni ombra sembra nascondere una storia, ma anche una sfida.",
    "actions": {
      "Prosegui lungo il sentiero meno battuto, più in profondità nel cuore del bosco": "forest_deep"
    }
  },
  "forest_deep": {
    "text": "Dopo ore di cammino, il bosco si fa più denso, quasi che la natura stessa volesse custodire il suo tesoro più gelosamente. L'aria diventa più fresca, un sentore di muschio bagnato e magia si diffonde. Si sente l'eco di una leggenda, la Fonte è vicina.",
    "actions": {
      "Segui il richiamo della magia e cerca la Fonte nascosta": "at_spring"
    }
  },
  "at_spring": {
    "text": "Finalmente, Elia giunge a una piccola radura. Al centro, la Fonte Magica riposa in un sonno profondo. L'acqua, di solito cristallina e vibrante, è immobile e opaca, come uno specchio che ha dimenticato di riflettere. È lì, in attesa della sua storia.",
    "actions": {
      "Avvicinati alla Fonte e inizia a raccontare la storia più bella che conosci": "spring_awakened"
    }
  },
  "spring_awakened": {
    "text": "Mentre Elia racconta, la sua voce, intrisa di speranza e amore per il suo villaggio, risuona nell'aria. L'acqua della Fonte inizia a fremere, poi a gorgogliare, e infine a zampillare con una luce vibrante. Una dolce pioggia comincia a cadere, prima leggera, poi più intensa, un dono dal cielo che danza sulle foglie e sulla terra assetata. La magia è tornata, e con essa la vita al villaggio.",
    "actions": {}
  }
}